output/dot/2.dot
digraph
{
   _01 [ label = "NEWTABLE 3 0 0" ];
   _02 [ label = "EXTRAARG 0" ];
   _03 [ label = "LOADFALSE 4" ];
   _04 [ label = "MOVE 5 1" ];
   _05 [ label = "LOADNIL 6 1" ];
   _06 [ label = "GETTABUP 8 0 0" ];
   _07 [ label = "MOVE 9 0" ];
   _08 [ label = "CALL 8 2 5" ];
   _09 [ label = "TFORPREP 8 38" ];
   _10 [ label = "SELF 13 12 1" ];
   _11 [ label = "CALL 13 2 2" ];
   _12 [ label = "SELF 14 12 2" ];
   _13 [ label = "CALL 14 2 2" ];
   _14 [ label = "MOVE 6 13" ];
   _15 [ label = "LT 5 14 0" ];
   _16 [ label = "JMP 2" ];
   _17 [ label = "MOVE 7 5" ];
   _18 [ label = "JMP 1" ];
   _19 [ label = "MOVE 7 14" ];
   _20 [ label = "SUB 5 5 7" ];
   _21 [ label = "MMBIN 5 7 7" ];
   _22 [ label = "TEST 4 0" ];
   _23 [ label = "JMP 7" ];
   _24 [ label = "GETUPVAL 15 1" ];
   _25 [ label = "MOVE 16 3" ];
   _26 [ label = "GETFIELD 17 12 3" ];
   _27 [ label = "MOVE 18 6" ];
   _28 [ label = "MOVE 19 7" ];
   _29 [ label = "CALL 17 3 0" ];
   _30 [ label = "CALL 15 0 1" ];
   _31 [ label = "EQI 5 0 0" ];
   _32 [ label = "JMP 7" ];
   _33 [ label = "TEST 4 1" ];
   _34 [ label = "JMP 3" ];
   _35 [ label = "MOVE 5 2" ];
   _36 [ label = "LOADTRUE 4" ];
   _37 [ label = "JMP 2" ];
   _38 [ label = "CLOSE 8" ];
   _39 [ label = "JMP 11" ];
   _40 [ label = "LT 7 14 0" ];
   _41 [ label = "JMP 6" ];
   _42 [ label = "ADD 13 13 7" ];
   _43 [ label = "MMBIN 13 7 6" ];
   _44 [ label = "SUB 14 14 7" ];
   _45 [ label = "MMBIN 14 7 7" ];
   _46 [ label = "JMP -33" ];
   _47 [ label = "CLOSE 0" ];
   _48 [ label = "TFORCALL 8 2" ];
   _49 [ label = "TFORLOOP 8 40" ];
   _50 [ label = "CLOSE 8" ];
   _51 [ label = "RETURN 3 2 0k" ];
   _52 [ label = "RETURN 8 1 0k" ];

   _01 -> _02 -> _03 -> _04 -> _05 -> _06 -> _07 -> _08 ->
      _09 -> _48 -> _49 -> _10 -> _11 -> _12 -> _13 -> _14 ->
      _15 -> _16 -> _19 -> _20 -> _21 -> _22 -> _23 -> _31 ->
      _32 -> _40 -> _41 -> _48;
   _40 -> _42 -> _43 -> _44 -> _45 -> _46 -> _14;
   _44 -> _46;
   _42 -> _44;
   _31 -> _33 -> _34 -> _38 -> _39 -> _51;
   _33 -> _35 -> _36 -> _37 -> _40;
   _22 -> _24 -> _25 -> _26 -> _27 -> _28 -> _29 -> _30 ->
      _31;
   _20 -> _22;
   _15 -> _17 -> _18 -> _20;
   _49 -> _50 -> _51;
   _47 -> _48;
}
