output/mmd/2.mmd
flowchart TD
  _01["NEWTABLE 3 0 0"]
  _02["EXTRAARG 0"]
  _03["LOADFALSE 4"]
  _04["MOVE 5 1"]
  _05["LOADNIL 6 1"]
  _06["GETTABUP 8 0 0"]
  _07["MOVE 9 0"]
  _08["CALL 8 2 5"]
  _09["TFORPREP 8 38"]
  _10["SELF 13 12 1"]
  _11["CALL 13 2 2"]
  _12["SELF 14 12 2"]
  _13["CALL 14 2 2"]
  _14["MOVE 6 13"]
  _15["LT 5 14 0"]
  _16["JMP 2"]
  _17["MOVE 7 5"]
  _18["JMP 1"]
  _19["MOVE 7 14"]
  _20["SUB 5 5 7"]
  _21["MMBIN 5 7 7"]
  _22["TEST 4 0"]
  _23["JMP 7"]
  _24["GETUPVAL 15 1"]
  _25["MOVE 16 3"]
  _26["GETFIELD 17 12 3"]
  _27["MOVE 18 6"]
  _28["MOVE 19 7"]
  _29["CALL 17 3 0"]
  _30["CALL 15 0 1"]
  _31["EQI 5 0 0"]
  _32["JMP 7"]
  _33["TEST 4 1"]
  _34["JMP 3"]
  _35["MOVE 5 2"]
  _36["LOADTRUE 4"]
  _37["JMP 2"]
  _38["CLOSE 8"]
  _39["JMP 11"]
  _40["LT 7 14 0"]
  _41["JMP 6"]
  _42["ADD 13 13 7"]
  _43["MMBIN 13 7 6"]
  _44["SUB 14 14 7"]
  _45["MMBIN 14 7 7"]
  _46["JMP -33"]
  _47["CLOSE 0"]
  _48["TFORCALL 8 2"]
  _49["TFORLOOP 8 40"]
  _50["CLOSE 8"]
  _51["RETURN 3 2 0k"]
  _52["RETURN 8 1 0k"]

  _01 --> _02 --> _03 --> _04 --> _05 --> _06 --> _07 --> _08
  _08 --> _09 --> _48 --> _49 --> _10 --> _11 --> _12 --> _13
  _13 --> _14 --> _15 --> _16 --> _19 --> _20 --> _21 --> _22
  _22 --> _23 --> _31 --> _32 --> _40 --> _41 --> _48
  _40 --> _42 --> _43 --> _44 --> _45 --> _46 --> _14
  _44 --> _46
  _42 --> _44
  _31 --> _33 --> _34 --> _38 --> _39 --> _51
  _33 --> _35 --> _36 --> _37 --> _40
  _22 --> _24 --> _25 --> _26 --> _27 --> _28 --> _29 --> _30
  _30 --> _31
  _20 --> _22
  _15 --> _17 --> _18 --> _20
  _49 --> _50 --> _51
  _47 --> _48
